In [2]:
import pandas as pd
import numpy as np
df = pd. DataFrame ( {  'A': ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo' ],
                        'B' : ['one', 'one','two', 'three' ,'two', 'two', 'one', 'three'],
                        'C': np.random.randn(8),
                        'D': np.random.randn (8)})
df

     A      B         c         D
0  foo    one -0.356525  1.349112
1  bar    one  2.079162 -1.246716
2  foo    two -0.764497  0.000779
3  bar  three  0.713210 -1.378872
4  foo    two -1.314975  0.913698
5  bar    two -1.309456 -1.456039
6  foo    one -0.006455  1.769415
7  foo  three  0.167221  0.674647

In [3]:
grouped = df.groupby('A')

In [4]:
grouped.count()#统计A的值在其他中出现的次数

     B  c  D
A
bar  3  3  3
foo  5  5  5

In [6]:
grouped = df.groupby(['A','B'])
grouped.count()

           c  D
A   B
bar one    1  1
    three  1  1
    two    1  1
foo one    2  2
    three  1  1
    two    2  2

In [7]:
def get_letter_type(letter):
    if letter.lower() in 'aeiou':
        return 'a'
    else:
        return 'b'
grouped = df.groupby(get_letter_type,axis = 1)
grouped.count().iloc(0)

In [11]:
s = pd.Series([1,2,3,1,2,3],[8,7,5,8,7,5])
s

8    1
7    2
5    3
8    1
7    2
5    3
dtype: int64

In [12]:
grouped = s.groupby(level = 0)

In [13]:
grouped.first()#按索引第一部分排序

5    3
7    2
8    1
dtype: int64

In [14]:
grouped.last()

5    3
7    2
8    1
dtype: int64

In [16]:
grouped.sum()

5    6
7    4
8    2
dtype: int64

In [18]:
grouped = s.groupby(level = 0,sort = False)
grouped.first()

8    1
7    2
5    3
dtype: int64

In [21]:
df2 = pd.DataFrame({'X':['A','B','A','B'],'Y':[1,2,3,4]})
df2

   X  Y
0  A  1
1  B  2
2  A  3
3  B  4

In [22]:
df2.groupby(['X']).get_group('B')#对于x得到b的分组

   X  Y
1  B  2
3  B  4

In [23]:
arrays = [ ['bar', ' bar', ' baz', ' baz','foo', 'foo', ' qux', ' qux'],
           ['one', 'two', 'one', 'two', 'one', 'two’','one', 'two']]
arrays

[['bar', ' bar', ' baz', ' baz', 'foo', 'foo', ' qux', ' qux'],
 ['one', 'two', 'one', 'two', 'one', 'two’', 'one', 'two']]

In [26]:
index = pd.MultiIndex.from_arrays(arrays,names =[ 'first','second'])
s = pd.Series(np.random.randn(8),index = index)
s

first  second
bar    one       1.539586
 bar   two      -0.787811
 baz   one      -1.012456
       two      -1.007637
foo    one       0.577379
       two’     -0.487124
 qux   one       0.134155
       two      -0.267915
dtype: float64

In [27]:
grouped = s.groupby(level = 0)
grouped.sum()

first
 bar   -0.787811
 baz   -2.020093
 qux   -0.133760
bar     1.539586
foo     0.090255
dtype: float64

In [28]:
grouped = s.groupby(level = 1)
grouped.sum()

second
one     1.238663
two    -2.063363
two’   -0.487124
dtype: float64

In [29]:
grouped = s.groupby(level = 'first')
grouped.sum()

first
 bar   -0.787811
 baz   -2.020093
 qux   -0.133760
bar     1.539586
foo     0.090255
dtype: float64

In [30]:
grouped = df.groupby(['A','B'])
grouped.aggregate(np.sum)

                  c         D
A   B
bar one    2.079162 -1.246716
    three  0.713210 -1.378872
    two   -1.309456 -1.456039
foo one   -0.362980  3.118528
    three  0.167221  0.674647
    two   -2.079472  0.914477

In [31]:
df.groupby(['A','B']).sum().reset_index()

     A      B         c         D
0  bar    one  2.079162 -1.246716
1  bar  three  0.713210 -1.378872
2  bar    two -1.309456 -1.456039
3  foo    one -0.362980  3.118528
4  foo  three  0.167221  0.674647
5  foo    two -2.079472  0.914477

In [32]:
grouped = df.groupby(['A','B'])
grouped.size()

A    B
bar  one      1
     three    1
     two      1
foo  one      2
     three    1
     two      2
dtype: int64

In [34]:
grouped.describe().head()

              c                                                              \
          count      mean       std       min       25%       50%       75%
A   B
bar one     1.0  2.079162       NaN  2.079162  2.079162  2.079162  2.079162
    three   1.0  0.713210       NaN  0.713210  0.713210  0.713210  0.713210
    two     1.0 -1.309456       NaN -1.309456 -1.309456 -1.309456 -1.309456
foo one     2.0 -0.181490  0.247537 -0.356525 -0.269008 -0.181490 -0.093972
    three   1.0  0.167221       NaN  0.167221  0.167221  0.167221  0.167221

                        D                                                    \
                max count      mean       std       min       25%       50%
A   B
bar one    2.079162   1.0 -1.246716       NaN -1.246716 -1.246716 -1.246716
    three  0.713210   1.0 -1.378872       NaN -1.378872 -1.378872 -1.378872
    two   -1.309456   1.0 -1.456039       NaN -1.456039 -1.456039 -1.456039
foo one   -0.006455   2.0  1.559264  0.297199  1.349112  1.454188  1.559264
    three  0.167221   1.0  0.674647       NaN  0.674647  0.674647  0.674647


                75%       max
A   B
bar one   -1.246716 -1.246716
    three -1.378872 -1.378872
    two   -1.456039 -1.456039
foo one    1.664340  1.769415
    three  0.674647  0.674647